<p style="align: center;"><img align=center src="https://s8.hostingkartinok.com/uploads/images/2018/08/308b49fcfbc619d629fe4604bceb67ac.jpg" style="height:450px;" width=500/></p>

<h3 style="text-align: center;"><b>Школа глубокого обучения ФПМИ МФТИ</b></h3>

<h1 style="text-align: center;"><b>Семинар. Библиотека Pandas</b></h1>

Библиотека `pandas` активно используется в современном data science для работы с данными, которые могут быть представлены в виде таблиц (а это очень, очень большая часть данных)

`pandas` есть в пакете Anaconda, но если вдруг у Вас её по каким-то причинам нет, то можно установить, раскомментировав одну из следующих команд:

In [ ]:
# !pip3 install pandas
# !conda install pandas

In [1]:
import numpy as np
import pandas as pd # Стандартное сокращение для pandas. Всегда используйте его!

# pd.Series

Тип данных pd.Series представляет собой одномерный набор данных. Отсутствующий данные записываются как `np.nan` (в этот день термометр сломался или метеоролог был пьян); они не участвуют в вычислении средних, среднеквадратичных отклонений и т.д.

### Создание
Создадим Series из списка температур

In [2]:
some_list = [1, 3, 5, np.nan, 6, 8]
ser_1 = pd.Series(some_list)
ser_1

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# Так же можно в явном виде указать индексы, чтобы потом было более удобно обращаться к элементам
ind = ['1st day', '2nd day', '3rd day', '4th day', '5rd day', '6th day']

ser_2 = pd.Series(some_list, index=ind)
ser_2

1st day    1.0
2nd day    3.0
3rd day    5.0
4th day    NaN
5rd day    6.0
6th day    8.0
dtype: float64

In [4]:
ser_2['4th day']

nan

In [5]:
# А еще можно дать pd.Series имя, чтобы было совсем красиво
ser_3 = pd.Series(some_list, index=ind, name='Temperature')
ser_3

1st day    1.0
2nd day    3.0
3rd day    5.0
4th day    NaN
5rd day    6.0
6th day    8.0
Name: Temperature, dtype: float64

### Индексирование
С индексами можно работать так же, как и в случае с обычным list.

In [6]:
print(ser_3[0])

print('-----------')

print(ser_3[1:3])

print('-----------')

print(ser_3[::-1])

1.0
-----------
2nd day    3.0
3rd day    5.0
Name: Temperature, dtype: float64
-----------
6th day    8.0
5rd day    6.0
4th day    NaN
3rd day    5.0
2nd day    3.0
1st day    1.0
Name: Temperature, dtype: float64

### Индексирование pd.Series по условиям

In [7]:
date_range = pd.date_range('20190101', periods=10)
ser_4 = pd.Series(np.random.rand(10), index=date_range)
ser_4

2019-01-01    0.971360
2019-01-02    0.692804
2019-01-03    0.109044
2019-01-04    0.170563
2019-01-05    0.037452
2019-01-06    0.580119
2019-01-07    0.130728
2019-01-08    0.066481
2019-01-09    0.775332
2019-01-10    0.964623
Freq: D, dtype: float64

In [8]:
ser_4 > 0.5

2019-01-01     True
2019-01-02     True
2019-01-03    False
2019-01-04    False
2019-01-05    False
2019-01-06     True
2019-01-07    False
2019-01-08    False
2019-01-09     True
2019-01-10     True
Freq: D, dtype: bool

В качестве индекса можно указать выражение, и нам будут возвращены только те элементы, для которых значение является `True`

In [9]:
ser_4[ser_4 > 0.5]

2019-01-01    0.971360
2019-01-02    0.692804
2019-01-06    0.580119
2019-01-09    0.775332
2019-01-10    0.964623
dtype: float64

In [10]:
ser_4[(ser_4 > 0.6) | (ser_4 < 0.2)]

2019-01-01    0.971360
2019-01-02    0.692804
2019-01-03    0.109044
2019-01-04    0.170563
2019-01-05    0.037452
2019-01-07    0.130728
2019-01-08    0.066481
2019-01-09    0.775332
2019-01-10    0.964623
dtype: float64

In [11]:
ser_4[(ser_4 > 0.6) & (ser_4 < 0.2)]

Series([], Freq: D, dtype: float64)

### Сортировки
Тип `pd.Series` можно отсортировать как по значениям, так и по индексу.

In [12]:
ser_4.sort_index()

2019-01-01    0.971360
2019-01-02    0.692804
2019-01-03    0.109044
2019-01-04    0.170563
2019-01-05    0.037452
2019-01-06    0.580119
2019-01-07    0.130728
2019-01-08    0.066481
2019-01-09    0.775332
2019-01-10    0.964623
Freq: D, dtype: float64

In [15]:
ser_4 = ser_4.sort_values(ascending=False)

In [16]:
ser_4

2019-01-01    0.971360
2019-01-10    0.964623
2019-01-09    0.775332
2019-01-02    0.692804
2019-01-06    0.580119
2019-01-04    0.170563
2019-01-07    0.130728
2019-01-03    0.109044
2019-01-08    0.066481
2019-01-05    0.037452
dtype: float64

### Операции с series
Тип `pd.Series` можно модифицировать проще, чем стандартный ``list`` из Python.

In [17]:
ser_4 + 100

2019-01-01    100.971360
2019-01-10    100.964623
2019-01-09    100.775332
2019-01-02    100.692804
2019-01-06    100.580119
2019-01-04    100.170563
2019-01-07    100.130728
2019-01-03    100.109044
2019-01-08    100.066481
2019-01-05    100.037452
dtype: float64

In [18]:
np.exp(ser_4)

2019-01-01    2.641535
2019-01-10    2.623797
2019-01-09    2.171314
2019-01-02    1.999314
2019-01-06    1.786251
2019-01-04    1.185972
2019-01-07    1.139657
2019-01-03    1.115212
2019-01-08    1.068741
2019-01-05    1.038162
dtype: float64

In [29]:
term_1 = pd.Series(np.random.randint(0, 10, 5))
term_1

0    6
1    3
2    1
3    7
4    8
dtype: int32

In [30]:
term_2 = pd.Series(np.random.randint(0, 10, 6))
term_2

0    4
1    1
2    6
3    3
4    0
5    4
dtype: int32

In [31]:
term_1 + term_2

0    10.0
1     4.0
2     7.0
3    10.0
4     8.0
5     NaN
dtype: float64

In [32]:
term_1.shape

(5,)

# pd.DataFrame

Тип данных pd.DataFrame представляет собой двумерную таблицу с данными. Имеет индекс и набор столбцов (возможно, имеющих разные типы). Таблицу можно построить, например, из словаря, значениями в котором являются одномерные наборы данных.
### Создание и основные объекты

In [33]:
# Dataframe можно составить из словаря. Ключ будет соответсовать колонке
some_dict = {'one': pd.Series([1,2,3], index=['a','b','c']),
             'two': pd.Series([1,2,3,4], index=['a','b','c','d']),
             'three': pd.Series([5,6,7,8], index=['a','b','c','d'])}
df = pd.DataFrame(some_dict)
df

   one  two  three
a  1.0    1      5
b  2.0    2      6
c  3.0    3      7
d  NaN    4      8

In [42]:
# /юб/
some_dict = {'one': [1,2,3, np.nan],
             'two': [1,2,3,4],
             'three': [5,6,7,8]}
df = pd.DataFrame(some_dict, index=['a','b','c', 'd'])
df

   one  two  three
a  1.0    1      5
b  2.0    2      6
c  3.0    3      7
d  NaN    4      8

In [43]:
#Альтернативно, из списка списков с аргументом columns

some_array = [[1,1,5], [2,2,6], [3,3,7], [np.nan, 4,8]]
df = pd.DataFrame(some_array, index=['a', 'b', 'c', 'd'], columns=['one', 'two', 'three'])
df

   one  two  three
a  1.0    1      5
b  2.0    2      6
c  3.0    3      7
d  NaN    4      8

In [44]:
df.values

array([[ 1.,  1.,  5.],
       [ 2.,  2.,  6.],
       [ 3.,  3.,  7.],
       [nan,  4.,  8.]])

In [45]:
df.columns

Index(['one', 'two', 'three'], dtype='object')

In [47]:
df.columns = ['first_column', 'second_column', 'third_column']
df.index = [1,2,3,4]
df

   first_column  second_column  third_column
1           1.0              1             5
2           2.0              2             6
3           3.0              3             7
4           NaN              4             8

### Индексирование 
Есть очень много способов индексировать DataFrame в Pandas. Не все из них хорошие! Вот несколько удобных, но не универсальных.

#### По колонкам
Индексирование по колонке возращает pd.Series. Можно выбирать не одну колонку, а сразу несколько. Тогда снова вернётся pd.DataFrame.

In [48]:
first_column = df['first_column']
first_column

1    1.0
2    2.0
3    3.0
4    NaN
Name: first_column, dtype: float64

In [49]:
df.first_column

1    1.0
2    2.0
3    3.0
4    NaN
Name: first_column, dtype: float64

In [50]:
subset_dataframe = df[['first_column', 'second_column']]
subset_dataframe

   first_column  second_column
1           1.0              1
2           2.0              2
3           3.0              3
4           NaN              4

In [51]:
one_column_dataframe = df[['first_column']]
one_column_dataframe

   first_column
1           1.0
2           2.0
3           3.0
4           NaN

#### По строкам
Можно писать любые слайсы, как в Python-списке. Они будут применяться к строкам. Нельзя обращаться по элементу!

In [52]:
df[1] # не сработает

KeyError: 1

In [55]:
# /юб/ можно серию айлоком получить
df.iloc[1]

first_column     2.0
second_column    2.0
third_column     6.0
Name: 2, dtype: float64

In [53]:
df[:1]

   first_column  second_column  third_column
1           1.0              1             5

In [54]:
df[1:4]

   first_column  second_column  third_column
2           2.0              2             6
3           3.0              3             7
4           NaN              4             8

#### Универсальное индексирование: .loc и .iloc

.loc и .iloc --- это два взаимозаменяемых атрибута, которые позволяют индексировать по обеим осям сразу. Путаницы не возникает из-за фиксированного порядка перечисления осей.

In [56]:
# По индексам: 
df.iloc[1:3, :2]

   first_column  second_column
2           2.0              2
3           3.0              3

In [57]:
df.loc[1:3, ['first_column', 'second_column']]

   first_column  second_column
1           1.0              1
2           2.0              2
3           3.0              3

Лучше использовать по умолчанию либо только loc, либо только .iloc! А лучше вообще всегда только .iloc, чтобы не запутаться.

### Модификации датасета, создание новых колонок
Можно просто брать и создавать новую колонку. Синтаксис тут вполне естественный.

In [58]:
new_column = [5,2,1,4]
df['new_column'] = new_column
df

   first_column  second_column  third_column  new_column
1           1.0              1             5           5
2           2.0              2             6           2
3           3.0              3             7           1
4           NaN              4             8           4

Аналогично, можно применять к отдельным колонкам арифметические операции (ведь колонки --- это Series!)

In [59]:
df['first_column'] = df['first_column'] * 10
df

   first_column  second_column  third_column  new_column
1          10.0              1             5           5
2          20.0              2             6           2
3          30.0              3             7           1
4           NaN              4             8           4

## Реальный датасет
Мы будем работать с датасетом ``Титаник``. Файлы необходимо скачать локально или загрузить с помощью функции ниже.
![alt text](https://drive.google.com/uc?id=1Tb52nFFsjI8sqv0AlMpx25aNJ62xzp5w)

Информация о файлах: 
 - *titanic_data.csv* содержит различную информацию о пассажирах Титаника (билет, класс, возраст и т.п.)
 - *titanic_surv.csv* содержит для каждого пассажира из первого файла информацию о том, выжил ли этот пассажир (метка 1) или нет (метка 0)


### Чтение из файла
Обычно данные хранятся в виде таблиц в файлах формата .csv или .xlsx. На этом семинаре мы будем загружать данные из .csv файлов.


 
Загрузим первый файл

In [60]:
# df_1 = pd.read_csv('titanic_data.csv')
pass_link = 'https://www.dropbox.com/s/lyzcuxu1pdrw5qb/titanic_data.csv?dl=1'
titanic_passengers = pd.read_csv(pass_link, index_col='PassengerId') # index_col=?

In [61]:
print('Всего пассажиров: ', len(titanic_passengers))
titanic_passengers.head(10)

Всего пассажиров:  891

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### Разная информация о датасете

Можно узнать размер таблицы, информацию о значениях таблицы, различные статистики по значениям.

In [62]:
titanic_passengers.shape

(891, 10)

In [63]:
titanic_passengers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Name      891 non-null    object
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Ticket    891 non-null    object
 7   Fare      891 non-null    float64
 8   Cabin     204 non-null    object
 9   Embarked  889 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 76.6+ KB

In [64]:
titanic_passengers.describe()

           Pclass         Age       SibSp       Parch        Fare
count  891.000000  714.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118    0.523008    0.381594   32.204208
std      0.836071   14.526497    1.102743    0.806057   49.693429
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   20.125000    0.000000    0.000000    7.910400
50%      3.000000   28.000000    0.000000    0.000000   14.454200
75%      3.000000   38.000000    1.000000    0.000000   31.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200

## Задание 1 
Опишите данный датасет: какое расределение женщин/мужчин в нем? Сколько пассажиров ехало в каждом классе? Какой средний/минимальный/максимальный возраст пассажиров?

In [66]:
titanic_passengers['Age'].min(), titanic_passengers['Age'].mean(), titanic_passengers['Age'].max()

(0.42, 29.69911764705882, 80.0)

In [67]:
titanic_passengers['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [68]:
titanic_passengers['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

## Задание 2
Сгруппируйте записи по классам пассажиров, в каждой группе посчитайте средний возраст. Используйте метод ``pandas.DataFrame.groupby``.

In [78]:
titanic_passengers.groupby(['Pclass']).mean()

              Age     SibSp     Parch       Fare
Pclass
1       38.233441  0.416667  0.356481  84.154687
2       29.877630  0.402174  0.380435  20.662183
3       25.140620  0.615071  0.393075  13.675550

In [77]:
# /юб/
titanic_passengers.groupby(['Pclass']).count()

        Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1        216  216  186    216    216     216   216    176       214
2        184  184  173    184    184     184   184     16       184
3        491  491  355    491    491     491   491     12       491

In [80]:
titanic_passengers.groupby(['Pclass'])['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

## Слияние таблиц
Таблицы можно сливать несколькими способами. Мы рассмотрим слияние по индексу: метод называется ``pd.join``.

In [81]:
# df_2 = pd.read_csv('titanic_surv.csv')
surv_link = 'https://www.dropbox.com/s/v35x9i6a1tc7emm/titanic_surv.csv?dl=1'
df_2 = pd.read_csv(surv_link)

In [82]:
df_2.head()

   Survived
0         0
1         1
2         1
3         1
4         0

### Задание 3.
Слейте два датасета по колонке индекса.

In [83]:
df_2.index = np.arange(1, 892)

In [90]:
df_2 = df_2.sample(frac=1)
df_2.head()

     Survived
866         1
554         1
689         0
772         0
384         1

In [91]:
titanic_passengers = titanic_passengers.join(df_2)
titanic_passengers.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [119]:
# /юб/
titanic_passengers.sample(n=3, axis=1)

                Fare   Age Embarked
PassengerId
1             7.2500  22.0        S
2            71.2833  38.0        C
3             7.9250  26.0        S
4            53.1000  35.0        S
5             8.0500  35.0        S
...              ...   ...      ...
887          13.0000  27.0        S
888          30.0000  19.0        S
889          23.4500   NaN        S
890          30.0000  26.0        C
891           7.7500  32.0        Q

[891 rows x 3 columns]

### Задание 4. 
Сколько всего выживших пассажиров? Выживших пассажиров по каждому из полов? Постройте матрицу корреляций факта выживания, пола и возраста.

In [120]:
titanic_passengers['Survived'].sum()

342

In [122]:
titanic_passengers.groupby(['Sex'])['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [123]:
corr_data = titanic_passengers[['Sex', 'Age', 'Survived']]
corr_data['Sex'] = (corr_data['Sex'] == 'female').astype(int)

<ipython-input-123-01b0889c0fdd>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  corr_data['Sex'] = (corr_data['Sex'] == 'female').astype(int)

In [125]:
corr_data.head()

             Sex   Age  Survived
PassengerId
1              0  22.0         0
2              1  38.0         1
3              1  26.0         1
4              1  35.0         1
5              0  35.0         0

In [126]:
corr_data.corr()

               Sex       Age  Survived
Sex       1.000000 -0.093254  0.543351
Age      -0.093254  1.000000 -0.077221
Survived  0.543351 -0.077221  1.000000

In [ ]:
import seaborn as sns

In [ ]:
sns.heatmap(corr_data.corr(), annot=True, cmap='coolwarm',
            vmin=-1, vmax=1, annot_kws={"size": 16})